**주어진 데이터에서 2022년 월별 Sales 합계 중 가장 큰 금액과\
2023년 월별 Sales 합계 중 가장 큰 금액의 차이를 절대값으로 구하시오.\
단 Events컬럼이 '1'인경우 80%의 Salse값만 반영함\
(최종값은 소수점 반올림 후 정수 출력)**
- 데이터셋 : basic2.csv
- 오른쪽 상단 copy&edit 클릭 -> 예상문제 풀이 시작

In [1]:
import pandas as pd

df = pd.read_csv('../../dataset/basic2.csv')
df.head()

         Date     Sales      PV      UV  Events
0  2022-01-01  22711525  397349  4421.0       1
1  2022-01-02     36779    3969  2289.0       0
2  2022-01-03  13943875  373890     NaN       1
3  2022-01-04   8088593  142054  2157.0       0
4  2022-01-05   2395374  190684     NaN       0

## User Code

## Solution

In [2]:
df['Date'] = pd.to_datetime(df['Date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    730 non-null    datetime64[ns]
 1   Sales   730 non-null    int64
 2   PV      730 non-null    int64
 3   UV      684 non-null    float64
 4   Events  730 non-null    int64
dtypes: datetime64[ns](1), float64(1), int64(3)
memory usage: 28.6 KB

In [3]:
df['year'] = df['Date'].dt.year
df['month'] = df['Date'].dt.month
df.head()

        Date     Sales      PV      UV  Events  year  month
0 2022-01-01  22711525  397349  4421.0       1  2022      1
1 2022-01-02     36779    3969  2289.0       0  2022      1
2 2022-01-03  13943875  373890     NaN       1  2022      1
3 2022-01-04   8088593  142054  2157.0       0  2022      1
4 2022-01-05   2395374  190684     NaN       0  2022      1

In [4]:
def event_sales(x):
    if x['Events'] == 1:
        x['Sales2'] = x['Sales'] * 0.8
    else:
        x['Sales2'] = x['Sales']
    return x
df = df.apply(lambda x: event_sales(x), axis=1) #1일 경우 열
df.head()

        Date     Sales      PV      UV  Events  year  month      Sales2
0 2022-01-01  22711525  397349  4421.0       1  2022      1  18169220.0
1 2022-01-02     36779    3969  2289.0       0  2022      1     36779.0
2 2022-01-03  13943875  373890     NaN       1  2022      1  11155100.0
3 2022-01-04   8088593  142054  2157.0       0  2022      1   8088593.0
4 2022-01-05   2395374  190684     NaN       0  2022      1   2395374.0

In [5]:
max_2022 = df[df['year']==2022].groupby('month')['Sales2'].sum().max()
max_2023 = df[df['year']==2023].groupby('month')['Sales2'].sum().max()
max_2022, max_2023

(197145878.0, 239619313.8)

In [6]:
int(round(abs(max_2022-max_2023), 0))

42473436